tap "elastic/tap"
tap "gcenx/wine"
tap "homebrew/services"
tap "kegworks-app/kegworks"
tap "mongodb/brew"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "glib"
brew "cairo"
brew "openjdk@17"
brew "apache-spark"
brew "apr-util"
brew "astro"
brew "bash"
brew "ripgrep"
brew "codex"
brew "freetds"
brew "fzf"
brew "libavif"
brew "gd"
brew "gemini-cli"
brew "gh"
brew "git-lfs"
brew "libidn2"
brew "go"
brew "jenv"
brew "kafka"
brew "neovim"
brew "node@16"
brew "nvm"
brew "openjdk@21"
brew "php"
brew "postgresql@14", restart_service: :changed
brew "pyenv"
brew "python@3.12"
brew "rbenv"
brew "tmux"
brew "tree"
brew "vips"
brew "wimlib"
brew "zookeeper"
brew "mongodb/brew/mongodb-community@4.4"
cask "anki"
cask "ghostty"
cask "google-chrome"
cask "gstreamer-runtime"
cask "iterm2"
cask "monitorcontrol"
cask "vmware-fusion"
vscode "bradlc.vscode-tailwindcss"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "justusadam.language-haskell"
vscode "mgmcdermott.vscode-language-babel"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "mtxr.sqltools"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "rangav.vscode-thunder-client"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "skyran.js-jsx-snippets"
vscode "streetsidesoftware.code-spell-checker"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "vunguyentuan.vscode-postcss"
vscode "wholroyd.jinja"
vscode "xabikos.javascriptsnippets"
vscode "zignd.html-css-class-completion"
go "github.com/air-verse/air"
go "github.com/klauspost/asmfmt/cmd/asmfmt"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/kisielk/errcheck"
go "github.com/davidrjenni/reftools/cmd/fillstruct"
go "github.com/rogpeppe/godef"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "github.com/fatih/gomodifytags"
go "golang.org/x/tools/gopls"
go "github.com/jstemmer/gotags"
go "gotest.tools/gotestsum"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/fatih/motion"
go "github.com/mgechev/revive"
go "honnef.co/go/tools/cmd/staticcheck"
